theophieleroy/rapid_iot_mcuxpresso_examples/board/pin_mux.c
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v4.0
processor: MK64FN1M0xxx12
package_id: MK64FN1M0VMD12
mcu_data: ksdk2_0
processor_version: 3.0.1
pin_labels:
- {pin_num: A1, pin_signal: PTD7/CMT_IRO/UART0_TX/FTM0_CH7/FTM0_FLT1/SPI1_SIN, label: SPI1_MISO, identifier: SPI1_MISO}
- {pin_num: J5, pin_signal: PTA0/UART0_CTS_b/UART0_COL_b/FTM0_CH5/JTAG_TCLK/SWD_CLK/EZP_CLK, label: SWD_CLK, identifier: SWDCLK}
- {pin_num: J6, pin_signal: PTA1/UART0_RX/FTM0_CH6/JTAG_TDI/EZP_DI, label: AIR_WAKEN, identifier: AIR_WAKEN}
- {pin_num: K6, pin_signal: PTA2/UART0_TX/FTM0_CH7/JTAG_TDO/TRACE_SWO/EZP_DO, label: TOUCH_RST, identifier: TOUCH_RST}
- {pin_num: K7, pin_signal: PTA3/UART0_RTS_b/FTM0_CH0/JTAG_TMS/SWD_DIO, label: K64_SWDIO, identifier: K64_SWDIO}
- {pin_num: L7, pin_signal: PTA4/LLWU_P3/FTM0_CH1/NMI_b/EZP_CS_b, label: USER_SW1, identifier: USER_SW1}
- {pin_num: M8, pin_signal: PTA5/USB_CLKIN/FTM0_CH2/RMII0_RXER/MII0_RXER/CMP2_OUT/I2S0_TX_BCLK/JTAG_TRST_b, label: I2S_TX_BCLK, identifier: I2S_TX_BCLK}
- {pin_num: J7, pin_signal: PTA6/FTM0_CH3/CLKOUT/TRACE_CLKOUT, label: AIR_RESETN, identifier: AIR_RESETN}
- {pin_num: J8, pin_signal: ADC0_SE10/PTA7/FTM0_CH4/TRACE_D3, label: AIR_QUALITY_EN, identifier: AIR_QUALITY_EN}
- {pin_num: K8, pin_signal: ADC0_SE11/PTA8/FTM1_CH0/FTM1_QD_PHA/TRACE_D2, label: BUZZER_PWM, identifier: BUZZER_PWM}
- {pin_num: M9, pin_signal: PTA10/FTM2_CH0/MII0_RXD2/FTM2_QD_PHA/TRACE_D0, label: MB1_PWM, identifier: MB1_PWM}
- {pin_num: L9, pin_signal: PTA11/FTM2_CH1/MII0_RXCLK/I2C2_SDA/FTM2_QD_PHB, label: MB2_PWM, identifier: MB2_PWM}
- {pin_num: K9, pin_signal: CMP2_IN0/PTA12/CAN0_TX/FTM1_CH0/RMII0_RXD1/MII0_RXD1/I2C2_SCL/I2S0_TXD0/FTM1_QD_PHA, label: I2S_TXD, identifier: I2S_TXD}
- {pin_num: J9, pin_signal: CMP2_IN1/PTA13/LLWU_P4/CAN0_RX/FTM1_CH1/RMII0_RXD0/MII0_RXD0/I2C2_SDA/I2S0_TX_FS/FTM1_QD_PHB, label: I2S_TX_FS;I2C2_SDA, identifier: I2S_TX_FS;I2C2_SDA}
- {pin_num: L10, pin_signal: PTA14/SPI0_PCS0/UART0_TX/RMII0_CRS_DV/MII0_RXDV/I2C2_SCL/I2S0_RX_BCLK/I2S0_TXD1, label: I2S_RX_BCLK;I2C2_SCL, identifier: I2S_RX_BCLK;I2C2_SCL}
- {pin_num: L11, pin_signal: PTA15/SPI0_SCK/UART0_RX/RMII0_TXEN/MII0_TXEN/I2S0_RXD0, label: I2S_RXD, identifier: I2S_RXD}
- {pin_num: K10, pin_signal: PTA16/SPI0_SOUT/UART0_CTS_b/UART0_COL_b/RMII0_TXD0/MII0_TXD0/I2S0_RX_FS/I2S0_RXD1, label: I2S_RX_FS, identifier: I2S_RX_FS}
- {pin_num: K11, pin_signal: ADC1_SE17/PTA17/SPI0_SIN/UART0_RTS_b/RMII0_TXD1/MII0_TXD1/I2S0_MCLK, label: I2S_MCLK, identifier: I2S_MCLK}
- {pin_num: M12, pin_signal: EXTAL0/PTA18/FTM0_FLT2/FTM_CLKIN0, label: K64_EXTAL, identifier: K64_EXTAL}
- {pin_num: M11, pin_signal: XTAL0/PTA19/FTM1_FLT0/FTM_CLKIN1/LPTMR0_ALT1, label: K64_XTAL, identifier: K64_XTAL}
- {pin_num: K12, pin_signal: PTA24/MII0_TXD2/FB_A29, label: TOUCH_TXEN, identifier: TOUCH_TXEN}
- {pin_num: J12, pin_signal: PTA25/MII0_TXCLK/FB_A28, label: AUTH_RST, identifier: AUTH_RST}
- {pin_num: J11, pin_signal: PTA26/MII0_TXD3/FB_A27, label: MB2_RST, identifier: MB2_RST}
- {pin_num: J10, pin_signal: PTA27/MII0_CRS/FB_A26, label: AIR_INTN, identifier: AIR_INTN}
- {pin_num: H12, pin_signal: PTA28/MII0_TXER/FB_A25, label: NTAG_FD, identifier: NTAG_FD}
- {pin_num: H11, pin_signal: PTA29/MII0_COL/FB_A24, label: CHG_STATE, identifier: CHG_STATE}
- {pin_num: H10, pin_signal: ADC0_SE8/ADC1_SE8/PTB0/LLWU_P5/I2C0_SCL/FTM1_CH0/RMII0_MDIO/MII0_MDIO/FTM1_QD_PHA, label: KW41_WAKE_UP, identifier: KW41_WAKE_UP}
- {pin_num: H9, pin_signal: ADC0_SE9/ADC1_SE9/PTB1/I2C0_SDA/FTM1_CH1/RMII0_MDC/MII0_MDC/FTM1_QD_PHB, label: MB3_PWM, identifier: MB3_PWM}
- {pin_num: G12, pin_signal: ADC0_SE12/PTB2/I2C0_SCL/UART0_RTS_b/ENET0_1588_TMR0/FTM0_FLT3, label: I2C0_SCL, identifier: I2C0_SCL}
- {pin_num: G11, pin_signal: ADC0_SE13/PTB3/I2C0_SDA/UART0_CTS_b/UART0_COL_b/ENET0_1588_TMR1/FTM0_FLT0, label: I2C0_SDA, identifier: I2C0_SDA}
- {pin_num: G10, pin_signal: ADC1_SE10/PTB4/ENET0_1588_TMR2/FTM1_FLT0, label: MB1_INT, identifier: MB1_INT}
- {pin_num: F12, pin_signal: ADC1_SE12/PTB6/FB_AD23, label: MB3_AN, identifier: MB3_AN}
- {pin_num: F11, pin_signal: ADC1_SE13/PTB7/FB_AD22, label: MB3_INT, identifier: MB3_INT}
- {pin_num: F10, pin_signal: PTB8/UART3_RTS_b/FB_AD21, label: MB2_INT, identifier: MB2_INT}
- {pin_num: F9, pin_signal: PTB9/SPI1_PCS1/UART3_CTS_b/FB_AD20, label: SPI1_PCS1, identifier: SPI1_PCS1}
- {pin_num: E12, pin_signal: ADC1_SE14/PTB10/SPI1_PCS0/UART3_RX/FB_AD19/FTM0_FLT1, label: MB3_RST, identifier: MB3_RST}
- {pin_num: E11, pin_signal: ADC1_SE15/PTB11/SPI1_SCK/UART3_TX/FB_AD18/FTM0_FLT2, label: MB1_RST, identifier: MB1_RST}
- {pin_num: E10, pin_signal: PTB16/SPI1_SOUT/UART0_RX/FTM_CLKIN0/FB_AD17/EWM_IN, label: UART_DBG_RX, identifier: UART_DBG_RX}
- {pin_num: E9, pin_signal: PTB17/SPI1_SIN/UART0_TX/FTM_CLKIN1/FB_AD16/EWM_OUT_b, label: UART_DBG_TX, identifier: UART_DBG_TX}
- {pin_num: D12, pin_signal: PTB18/CAN0_TX/FTM2_CH0/I2S0_TX_BCLK/FB_AD15/FTM2_QD_PHA, label: CAN_TX, identifier: CAN_TX}
- {pin_num: D11, pin_signal: PTB19/CAN0_RX/FTM2_CH1/I2S0_TX_FS/FB_OE_b/FTM2_QD_PHB, label: CAN_RX, identifier: CAN_RX}
- {pin_num: D10, pin_signal: PTB20/SPI2_PCS0/FB_AD31/CMP0_OUT, label: DISP_SPI_CS, identifier: DISP_SPI_CS}
- {pin_num: C12, pin_signal: PTB22/SPI2_SOUT/FB_AD29/CMP2_OUT, label: DISP_SPI_SDI, identifier: DISP_SPI_SDI}
- {pin_num: C11, pin_signal: PTB23/SPI2_SIN/SPI0_PCS5/FB_AD28, label: KW41_RST, identifier: KW41_RST}
- {pin_num: B12, pin_signal: ADC0_SE14/PTC0/SPI0_PCS4/PDB0_EXTRG/USB_SOF_OUT/FB_AD14/I2S0_TXD1, label: AMB_INT, identifier: AMB_INT}
- {pin_num: B11, pin_signal: ADC0_SE15/PTC1/LLWU_P6/SPI0_PCS3/UART1_RTS_b/FTM0_CH0/FB_AD13/I2S0_TXD0, label: ACCEL_INT1, identifier: ACCEL_INT1}
- {pin_num: A12, pin_signal: ADC0_SE4b/CMP1_IN0/PTC2/SPI0_PCS2/UART1_CTS_b/FTM0_CH1/FB_AD12/I2S0_TX_FS, label: MB3_SPI_CS, identifier: MB3_SPI_CS}
- {pin_num: A11, pin_signal: CMP1_IN1/PTC3/LLWU_P7/SPI0_PCS1/UART1_RX/FTM0_CH2/CLKOUT/I2S0_TX_BCLK, label: MB2_SPI_CS, identifier: MB2_SPI_CS}
- {pin_num: A9, pin_signal: PTC4/LLWU_P8/SPI0_PCS0/UART1_TX/FTM0_CH3/FB_AD11/CMP1_OUT, label: MB1_SPI_CS, identifier: MB1_SPI_CS}
- {pin_num: D8, pin_signal: PTC5/LLWU_P9/SPI0_SCK/LPTMR0_ALT2/I2S0_RXD0/FB_AD10/CMP0_OUT/FTM0_CH2, label: MB_SPI_SCK, identifier: MB_SPI_SCK}
- {pin_num: C8, pin_signal: CMP0_IN0/PTC6/LLWU_P10/SPI0_SOUT/PDB0_EXTRG/I2S0_RX_BCLK/FB_AD9/I2S0_MCLK, label: MB_SPI_MOSI, identifier: MB_SPI_MOSI}
- {pin_num: B8, pin_signal: CMP0_IN1/PTC7/SPI0_SIN/USB_SOF_OUT/I2S0_RX_FS/FB_AD8, label: MB_SPI_MISO, identifier: MB_SPI_MISO}
- {pin_num: D7, pin_signal: ADC1_SE5b/CMP0_IN3/PTC9/FTM3_CH5/I2S0_RX_BCLK/FB_AD6/FTM2_FLT0, label: RGB_B, identifier: RGB_B}
- {pin_num: A8, pin_signal: ADC1_SE4b/CMP0_IN2/PTC8/FTM3_CH4/I2S0_MCLK/FB_AD7, label: RGB_R, identifier: RGB_R}
- {pin_num: C7, pin_signal: ADC1_SE6b/PTC10/I2C1_SCL/FTM3_CH6/I2S0_RX_FS/FB_AD5, label: I2C1_SCL, identifier: I2C1_SCL}
- {pin_num: B7, pin_signal: ADC1_SE7b/PTC11/LLWU_P11/I2C1_SDA/FTM3_CH7/I2S0_RXD1/FB_RW_b, label: I2C1_SDA, identifier: I2C1_SDA}
- {pin_num: A7, pin_signal: PTC12/UART4_RTS_b/FB_AD27/FTM3_FLT0, label: NTAG_EN, identifier: NTAG_EN}
- {pin_num: D6, pin_signal: PTC13/UART4_CTS_b/FB_AD26, label: KW41_PB18, identifier: KW41_PB18}
- {pin_num: C6, pin_signal: PTC14/UART4_RX/FB_AD25, label: BAT_SENS_EN, identifier: BAT_SENS_EN}
- {pin_num: B6, pin_signal: PTC15/UART4_TX/FB_AD24, label: GYRO_RST, identifier: GYRO_RST}
- {pin_num: A6, pin_signal: PTC16/UART3_RX/ENET0_1588_TMR0/FB_CS5_b/FB_TSIZ1/FB_BE23_16_BLS15_8_b, label: UART3_RX, identifier: UART3_RX}
- {pin_num: D5, pin_signal: PTC17/UART3_TX/ENET0_1588_TMR1/FB_CS4_b/FB_TSIZ0/FB_BE31_24_BLS7_0_b, label: UART3_TX, identifier: UART3_TX}
- {pin_num: C5, pin_signal: PTC18/UART3_RTS_b/ENET0_1588_TMR2/FB_TBST_b/FB_CS2_b/FB_BE15_8_BLS23_16_b, label: GYRO_INT2, identifier: GYRO_INT2}
- {pin_num: B5, pin_signal: PTC19/UART3_CTS_b/ENET0_1588_TMR3/FB_CS3_b/FB_BE7_0_BLS31_24_b/FB_TA_b, label: USB_VBUS, identifier: USB_VBUS}
- {pin_num: L12, pin_signal: RESET_b, label: K64_RST, identifier: K64_RST}
- {pin_num: A5, pin_signal: PTD0/LLWU_P12/SPI0_PCS0/UART2_RTS_b/FTM3_CH0/FB_ALE/FB_CS1_b/FB_TS_b, label: RTC_INT, identifier: RTC_INT}
- {pin_num: D4, pin_signal: ADC0_SE5b/PTD1/SPI0_SCK/UART2_CTS_b/FTM3_CH1/FB_CS0_b, label: GYRO_INT1, identifier: GYRO_INT1}
- {pin_num: C4, pin_signal: PTD2/LLWU_P13/SPI0_SOUT/UART2_RX/FTM3_CH2/FB_AD4/I2C0_SCL, label: UART2_RX, identifier: UART2_RX}
- {pin_num: B4, pin_signal: PTD3/SPI0_SIN/UART2_TX/FTM3_CH3/FB_AD3/I2C0_SDA, label: UART2_TX, identifier: UART2_TX}
- {pin_num: A4, pin_signal: PTD4/LLWU_P14/SPI0_PCS1/UART0_RTS_b/FTM0_CH4/FB_AD2/EWM_IN/SPI1_PCS0, label: SPI1_PCS0, identifier: SPI1_PCS0}
- {pin_num: A3, pin_signal: ADC0_SE6b/PTD5/SPI0_PCS2/UART0_CTS_b/UART0_COL_b/FTM0_CH5/FB_AD1/EWM_OUT_b/SPI1_SCK, label: SPI1_SCK, identifier: SPI1_SCK}
- {pin_num: A2, pin_signal: ADC0_SE7b/PTD6/LLWU_P15/SPI0_PCS3/UART0_RX/FTM0_CH6/FB_AD0/FTM0_FLT0/SPI1_SOUT, label: SPI1_MOSI, identifier: SPI1_MOSI}
- {pin_num: B9, pin_signal: PTD9/I2C0_SDA/UART5_TX/FB_A17, label: DISP_EN, identifier: DISP_EN}
- {pin_num: B3, pin_signal: PTD10/UART5_RTS_b/FB_A18, label: PRESSURE_INT2, identifier: PRESSURE_INT2}
- {pin_num: B2, pin_signal: PTD11/SPI2_PCS0/UART5_CTS_b/SDHC0_CLKIN/FB_A19, label: ACCEL_RST, identifier: ACCEL_RST}
- {pin_num: B1, pin_signal: PTD12/SPI2_SCK/FTM3_FLT0/SDHC0_D4/FB_A20, label: PRESSURE_INT1, identifier: PRESSURE_INT1}
- {pin_num: C3, pin_signal: PTD13/SPI2_SOUT/SDHC0_D5/FB_A21, label: ACCEL_INT2, identifier: ACCEL_INT2}
- {pin_num: C2, pin_signal: PTD14/SPI2_SIN/SDHC0_D6/FB_A22, label: RTC_CLKOE, identifier: RTC_CLKOE}
- {pin_num: C1, pin_signal: PTD15/SPI2_PCS1/SDHC0_D7/FB_A23, label: DISP_DISP, identifier: DISP_DISP}
- {pin_num: D3, pin_signal: ADC1_SE4a/PTE0/SPI1_PCS1/UART1_TX/SDHC0_D1/TRACE_CLKOUT/I2C1_SDA/RTC_CLKOUT, label: SD_D1, identifier: SD_D1}
- {pin_num: D2, pin_signal: ADC1_SE5a/PTE1/LLWU_P0/SPI1_SOUT/UART1_RX/SDHC0_D0/TRACE_D3/I2C1_SCL/SPI1_SIN, label: SD_D0, identifier: SD_D0}
- {pin_num: D1, pin_signal: ADC0_DP2/ADC1_SE6a/PTE2/LLWU_P1/SPI1_SCK/UART1_CTS_b/SDHC0_DCLK/TRACE_D2, label: SD_CLK, identifier: SD_CLK}
- {pin_num: E4, pin_signal: ADC0_DM2/ADC1_SE7a/PTE3/SPI1_SIN/UART1_RTS_b/SDHC0_CMD/TRACE_D1/SPI1_SOUT, label: SD_CMD, identifier: SD_CMD}
- {pin_num: E3, pin_signal: PTE4/LLWU_P2/SPI1_PCS0/UART3_TX/SDHC0_D3/TRACE_D0, label: SD_D3, identifier: SD_D3}
- {pin_num: E2, pin_signal: PTE5/SPI1_PCS2/UART3_RX/SDHC0_D2/FTM3_CH0, label: SD_D2, identifier: SD_D2}
- {pin_num: E1, pin_signal: PTE6/SPI1_PCS3/UART3_CTS_b/I2S0_MCLK/FTM3_CH1/USB_SOF_OUT, label: DISP_EXTCOMIN, identifier: DISP_EXTCOMIN}
- {pin_num: F4, pin_signal: PTE7/UART3_RTS_b/I2S0_RXD0/FTM3_CH2, label: RGB_G, identifier: RGB_G}
- {pin_num: F2, pin_signal: PTE9/I2S0_TXD1/UART5_RX/I2S0_RX_BCLK/FTM3_CH4, label: USER_SW2, identifier: USER_SW2}
- {pin_num: F1, pin_signal: PTE10/UART5_CTS_b/I2S0_TXD0/FTM3_CH5, label: USER_SW3, identifier: USER_SW3}
- {pin_num: G4, pin_signal: PTE11/UART5_RTS_b/I2S0_TX_FS/FTM3_CH6, label: DISP_EXTMODE, identifier: DISP_EXTMODE}
- {pin_num: G3, pin_signal: PTE12/I2S0_TX_BCLK/FTM3_CH7, label: DISP_BLIGHT, identifier: DISP_BLIGHT}
- {pin_num: M4, pin_signal: ADC0_SE17/PTE24/UART4_TX/I2C0_SCL/EWM_OUT_b, label: KW41_UART_RX, identifier: KW41_UART_RX}
- {pin_num: K5, pin_signal: ADC0_SE18/PTE25/UART4_RX/I2C0_SDA/EWM_IN, label: KW41_UART_TX, identifier: KW41_UART_TX}
- {pin_num: K4, pin_signal: PTE26/ENET_1588_CLKIN/UART4_CTS_b/RTC_CLKOUT/USB_CLKIN, label: KW41_UART_RTS, identifier: KW41_UART_RTS}
- {pin_num: J4, pin_signal: PTE27/UART4_RTS_b, label: KW41_UART_CTS, identifier: KW41_UART_CTS}
- {pin_num: H4, pin_signal: PTE28, label: USER_SW4, identifier: USER_SW4}
- {pin_num: H1, pin_signal: USB0_DP, label: USB_DP, identifier: USB_DP}
- {pin_num: H2, pin_signal: USB0_DM, label: USB_DM, identifier: USB_DM}
- {pin_num: J3, pin_signal: ADC0_SE16/CMP1_IN2/ADC0_SE21, label: BAT_SENS, identifier: BAT_SENS}
- {pin_num: K3, pin_signal: ADC1_SE16/CMP2_IN2/ADC0_SE22, label: MB1_AN, identifier: MB1_AN}
- {pin_num: L3, pin_signal: DAC0_OUT/CMP1_IN3/ADC0_SE23, label: MB2_AN, identifier: MB2_AN}
- {pin_num: M6, pin_signal: EXTAL32, label: K64_EXTAL32, identifier: K64_EXTAL32}
- {pin_num: D9, pin_signal: PTB21/SPI2_SCK/FB_AD30/CMP1_OUT, label: DISP_SPI_SCK, identifier: DISP_SPI_SCK}
- {pin_num: C9, pin_signal: PTD8/I2C0_SCL/UART5_RX/FB_A16, label: AIR_QUALITY_I2C_EN, identifier: AIR_QUALITY_I2C_EN}
- {pin_num: L8, pin_signal: PTA9/FTM1_CH1/MII0_RXD3/FTM1_QD_PHB/TRACE_D1, label: TOUCH_INT, identifier: TOUCH_INT}
- {pin_num: G9, pin_signal: ADC1_SE11/PTB5/ENET0_1588_TMR3/FTM2_FLT0, label: NTAG_I2C_EN, identifier: NTAG_I2C_EN}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_port.h"
#include "pin_mux.h"

