theophieleroy/rapid_iot_mcuxpresso_examples/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
    /* Port A Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortA);
    /* Port B Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortB);
    /* Port C Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortC);
    /* Port D Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortD);
    /* Port E Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortE);

    /* PORTA0 (pin J5) is configured as JTAG_TCLK */
    PORT_SetPinMux(BOARD_INITPINS_SWDCLK_PORT, BOARD_INITPINS_SWDCLK_PIN, kPORT_MuxAlt7);

    /* PORTA1 (pin J6) is configured as PTA1 */
    PORT_SetPinMux(BOARD_INITPINS_AIR_WAKEN_PORT, BOARD_INITPINS_AIR_WAKEN_PIN, kPORT_MuxAsGpio);

    PORTA->PCR[1] = ((PORTA->PCR[1] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_ODE_MASK | PORT_PCR_ISF_MASK)))

                     /* Open Drain Enable: Open drain output is enabled on the corresponding pin, if the pin is
                      * configured as a digital output. */
                     | PORT_PCR_ODE(kPORT_OpenDrainEnable));

    /* PORTA10 (pin M9) is configured as FTM2_CH0 */
    PORT_SetPinMux(BOARD_INITPINS_MB1_PWM_PORT, BOARD_INITPINS_MB1_PWM_PIN, kPORT_MuxAlt3);

    /* PORTA11 (pin L9) is configured as FTM2_CH1 */
    PORT_SetPinMux(BOARD_INITPINS_MB2_PWM_PORT, BOARD_INITPINS_MB2_PWM_PIN, kPORT_MuxAlt3);

    /* PORTA12 (pin K9) is configured as I2S0_TXD0 */
    PORT_SetPinMux(BOARD_INITPINS_I2S_TXD_PORT, BOARD_INITPINS_I2S_TXD_PIN, kPORT_MuxAlt6);

    /* PORTA13 (pin J9) is configured as I2C2_SDA */
    PORT_SetPinMux(BOARD_INITPINS_I2C2_SDA_PORT, BOARD_INITPINS_I2C2_SDA_PIN, kPORT_MuxAlt5);

    PORTA->PCR[13] = ((PORTA->PCR[13] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_ODE_MASK | PORT_PCR_DSE_MASK | PORT_PCR_ISF_MASK)))

                      /* Open Drain Enable: Open drain output is enabled on the corresponding pin, if the pin is
                       * configured as a digital output. */
                      | PORT_PCR_ODE(kPORT_OpenDrainEnable)

                      /* Drive Strength Enable: High drive strength is configured on the corresponding pin, if pin
                       * is configured as a digital output. */
                      | PORT_PCR_DSE(kPORT_HighDriveStrength));

    /* PORTA14 (pin L10) is configured as I2C2_SCL */
    PORT_SetPinMux(BOARD_INITPINS_I2C2_SCL_PORT, BOARD_INITPINS_I2C2_SCL_PIN, kPORT_MuxAlt5);

    PORTA->PCR[14] = ((PORTA->PCR[14] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_ODE_MASK | PORT_PCR_DSE_MASK | PORT_PCR_ISF_MASK)))

                      /* Open Drain Enable: Open drain output is enabled on the corresponding pin, if the pin is
                       * configured as a digital output. */
                      | PORT_PCR_ODE(kPORT_OpenDrainEnable)

                      /* Drive Strength Enable: High drive strength is configured on the corresponding pin, if pin
                       * is configured as a digital output. */
                      | PORT_PCR_DSE(kPORT_HighDriveStrength));

    /* PORTA15 (pin L11) is configured as I2S0_RXD0 */
    PORT_SetPinMux(BOARD_INITPINS_I2S_RXD_PORT, BOARD_INITPINS_I2S_RXD_PIN, kPORT_MuxAlt6);

    /* PORTA16 (pin K10) is configured as I2S0_RX_FS */
    PORT_SetPinMux(BOARD_INITPINS_I2S_RX_FS_PORT, BOARD_INITPINS_I2S_RX_FS_PIN, kPORT_MuxAlt6);

    /* PORTA17 (pin K11) is configured as I2S0_MCLK */
    PORT_SetPinMux(BOARD_INITPINS_I2S_MCLK_PORT, BOARD_INITPINS_I2S_MCLK_PIN, kPORT_MuxAlt6);

    /* PORTA18 (pin M12) is configured as EXTAL0 */
    PORT_SetPinMux(PORTA, 18U, kPORT_PinDisabledOrAnalog);

    /* PORTA19 (pin M11) is configured as XTAL0 */
    PORT_SetPinMux(BOARD_INITPINS_K64_XTAL_PORT, BOARD_INITPINS_K64_XTAL_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTA2 (pin K6) is configured as PTA2 */
    PORT_SetPinMux(BOARD_INITPINS_TOUCH_RST_PORT, BOARD_INITPINS_TOUCH_RST_PIN, kPORT_MuxAsGpio);

    PORTA->PCR[2] = ((PORTA->PCR[2] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_ODE_MASK | PORT_PCR_ISF_MASK)))

                     /* Open Drain Enable: Open drain output is enabled on the corresponding pin, if the pin is
                      * configured as a digital output. */
                     | PORT_PCR_ODE(kPORT_OpenDrainEnable));

    /* PORTA24 (pin K12) is configured as PTA24 */
    PORT_SetPinMux(BOARD_INITPINS_TOUCH_TXEN_PORT, BOARD_INITPINS_TOUCH_TXEN_PIN, kPORT_MuxAsGpio);

    PORTA->PCR[24] = ((PORTA->PCR[24] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_ODE_MASK | PORT_PCR_ISF_MASK)))

                      /* Open Drain Enable: Open drain output is enabled on the corresponding pin, if the pin is
                       * configured as a digital output. */
                      | PORT_PCR_ODE(kPORT_OpenDrainEnable));

    /* PORTA25 (pin J12) is configured as PTA25 */
    PORT_SetPinMux(BOARD_INITPINS_AUTH_RST_PORT, BOARD_INITPINS_AUTH_RST_PIN, kPORT_MuxAsGpio);

    /* PORTA26 (pin J11) is configured as PTA26 */
    PORT_SetPinMux(BOARD_INITPINS_MB2_RST_PORT, BOARD_INITPINS_MB2_RST_PIN, kPORT_MuxAsGpio);

    /* PORTA27 (pin J10) is configured as PTA27 */
    PORT_SetPinMux(BOARD_INITPINS_AIR_INTN_PORT, BOARD_INITPINS_AIR_INTN_PIN, kPORT_MuxAsGpio);

    /* PORTA28 (pin H12) is configured as PTA28 */
    PORT_SetPinMux(BOARD_INITPINS_NTAG_FD_PORT, BOARD_INITPINS_NTAG_FD_PIN, kPORT_MuxAsGpio);

    /* PORTA29 (pin H11) is configured as PTA29 */
    PORT_SetPinMux(BOARD_INITPINS_CHG_STATE_PORT, BOARD_INITPINS_CHG_STATE_PIN, kPORT_MuxAsGpio);

    /* PORTA3 (pin K7) is configured as JTAG_TMS */
    PORT_SetPinMux(BOARD_INITPINS_K64_SWDIO_PORT, BOARD_INITPINS_K64_SWDIO_PIN, kPORT_MuxAlt7);

    /* PORTA4 (pin L7) is configured as PTA4 */
    PORT_SetPinMux(BOARD_INITPINS_USER_SW1_PORT, BOARD_INITPINS_USER_SW1_PIN, kPORT_MuxAsGpio);

    PORTA->PCR[4] = ((PORTA->PCR[4] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_PFE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | PORT_PCR_PS(kPORT_PullUp)

                     /* Pull Enable: Internal pullup or pulldown resistor is not enabled on the corresponding pin. */
                     | PORT_PCR_PE(kPORT_PullDisable)

