theophieleroy/rapid_iot_mcuxpresso_examples/board/pin_mux.c
                     /* Passive Filter Enable: Passive input filter is enabled on the corresponding pin, if the
                      * pin is configured as a digital input. Refer to the device data sheet for filter characteristics. */
                     | PORT_PCR_PFE(kPORT_PassiveFilterEnable));

    /* PORTA5 (pin M8) is configured as I2S0_TX_BCLK */
    PORT_SetPinMux(BOARD_INITPINS_I2S_TX_BCLK_PORT, BOARD_INITPINS_I2S_TX_BCLK_PIN, kPORT_MuxAlt6);

    /* PORTA6 (pin J7) is configured as PTA6 */
    PORT_SetPinMux(BOARD_INITPINS_AIR_RESETN_PORT, BOARD_INITPINS_AIR_RESETN_PIN, kPORT_MuxAsGpio);

    PORTA->PCR[6] = ((PORTA->PCR[6] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_ODE_MASK | PORT_PCR_DSE_MASK | PORT_PCR_ISF_MASK)))

                     /* Open Drain Enable: Open drain output is enabled on the corresponding pin, if the pin is
                      * configured as a digital output. */
                     | PORT_PCR_ODE(kPORT_OpenDrainEnable)

                     /* Drive Strength Enable: High drive strength is configured on the corresponding pin, if pin
                      * is configured as a digital output. */
                     | PORT_PCR_DSE(kPORT_HighDriveStrength));

    /* PORTA7 (pin J8) is configured as PTA7 */
    PORT_SetPinMux(BOARD_INITPINS_AIR_QUALITY_EN_PORT, BOARD_INITPINS_AIR_QUALITY_EN_PIN, kPORT_MuxAsGpio);

    PORTA->PCR[7] = ((PORTA->PCR[7] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pulldown resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | PORT_PCR_PS(kPORT_PullDown));

    /* PORTA8 (pin K8) is configured as FTM1_CH0 */
    PORT_SetPinMux(BOARD_INITPINS_BUZZER_PWM_PORT, BOARD_INITPINS_BUZZER_PWM_PIN, kPORT_MuxAlt3);

    /* PORTA9 (pin L8) is configured as PTA9 */
    PORT_SetPinMux(BOARD_INITPINS_TOUCH_INT_PORT, BOARD_INITPINS_TOUCH_INT_PIN, kPORT_MuxAsGpio);

    /* PORTB0 (pin H10) is configured as PTB0 */
    PORT_SetPinMux(BOARD_INITPINS_KW41_WAKE_UP_PORT, BOARD_INITPINS_KW41_WAKE_UP_PIN, kPORT_MuxAsGpio);

    /* PORTB1 (pin H9) is configured as FTM1_CH1 */
    PORT_SetPinMux(BOARD_INITPINS_MB3_PWM_PORT, BOARD_INITPINS_MB3_PWM_PIN, kPORT_MuxAlt3);

    /* PORTB10 (pin E12) is configured as PTB10 */
    PORT_SetPinMux(BOARD_INITPINS_MB3_RST_PORT, BOARD_INITPINS_MB3_RST_PIN, kPORT_MuxAsGpio);

    /* PORTB11 (pin E11) is configured as PTB11 */
    PORT_SetPinMux(BOARD_INITPINS_MB1_RST_PORT, BOARD_INITPINS_MB1_RST_PIN, kPORT_MuxAsGpio);

    /* PORTB16 (pin E10) is configured as UART0_RX */
    PORT_SetPinMux(BOARD_INITPINS_UART_DBG_RX_PORT, BOARD_INITPINS_UART_DBG_RX_PIN, kPORT_MuxAlt3);

    /* PORTB17 (pin E9) is configured as UART0_TX */
    PORT_SetPinMux(BOARD_INITPINS_UART_DBG_TX_PORT, BOARD_INITPINS_UART_DBG_TX_PIN, kPORT_MuxAlt3);

    /* PORTB18 (pin D12) is configured as CAN0_TX */
    PORT_SetPinMux(BOARD_INITPINS_CAN_TX_PORT, BOARD_INITPINS_CAN_TX_PIN, kPORT_MuxAlt2);

    /* PORTB19 (pin D11) is configured as CAN0_RX */
    PORT_SetPinMux(BOARD_INITPINS_CAN_RX_PORT, BOARD_INITPINS_CAN_RX_PIN, kPORT_MuxAlt2);

    /* PORTB2 (pin G12) is configured as I2C0_SCL */
    PORT_SetPinMux(BOARD_INITPINS_I2C0_SCL_PORT, BOARD_INITPINS_I2C0_SCL_PIN, kPORT_MuxAlt2);

    PORTB->PCR[2] = ((PORTB->PCR[2] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_ODE_MASK | PORT_PCR_DSE_MASK | PORT_PCR_ISF_MASK)))

                     /* Open Drain Enable: Open drain output is enabled on the corresponding pin, if the pin is
                      * configured as a digital output. */
                     | PORT_PCR_ODE(kPORT_OpenDrainEnable)

                     /* Drive Strength Enable: High drive strength is configured on the corresponding pin, if pin
                      * is configured as a digital output. */
                     | PORT_PCR_DSE(kPORT_HighDriveStrength));

    /* PORTB23 (pin C11) is configured as PTB23 */
    PORT_SetPinMux(BOARD_INITPINS_KW41_RST_PORT, BOARD_INITPINS_KW41_RST_PIN, kPORT_MuxAsGpio);

    PORTB->PCR[23] = ((PORTB->PCR[23] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_ODE_MASK | PORT_PCR_DSE_MASK)))
//            (~(PORT_PCR_ODE_MASK | PORT_PCR_DSE_MASK | PORT_PCR_ISF_MASK)))

                      /* Open Drain Enable: Open drain output is enabled on the corresponding pin, if the pin is
                       * configured as a digital output. */
                      | PORT_PCR_ODE(kPORT_OpenDrainEnable)

                      /* Drive Strength Enable: High drive strength is configured on the corresponding pin, if pin
                       * is configured as a digital output. */
                      | PORT_PCR_DSE(kPORT_HighDriveStrength));

    /* PORTB3 (pin G11) is configured as I2C0_SDA */
    PORT_SetPinMux(BOARD_INITPINS_I2C0_SDA_PORT, BOARD_INITPINS_I2C0_SDA_PIN, kPORT_MuxAlt2);

    PORTB->PCR[3] = ((PORTB->PCR[3] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_ODE_MASK | PORT_PCR_DSE_MASK | PORT_PCR_ISF_MASK)))

                     /* Open Drain Enable: Open drain output is enabled on the corresponding pin, if the pin is
                      * configured as a digital output. */
                     | PORT_PCR_ODE(kPORT_OpenDrainEnable)

                     /* Drive Strength Enable: High drive strength is configured on the corresponding pin, if pin
                      * is configured as a digital output. */
                     | PORT_PCR_DSE(kPORT_HighDriveStrength));

    /* PORTB4 (pin G10) is configured as PTB4 */
    PORT_SetPinMux(BOARD_INITPINS_MB1_INT_PORT, BOARD_INITPINS_MB1_INT_PIN, kPORT_MuxAsGpio);

    /* PORTB5 (pin G9) is configured as PTB5 */
    PORT_SetPinMux(BOARD_INITPINS_NTAG_I2C_EN_PORT, BOARD_INITPINS_NTAG_I2C_EN_PIN, kPORT_MuxAsGpio);

    /* PORTB6 (pin F12) is configured as ADC1_SE12 */
    PORT_SetPinMux(BOARD_INITPINS_MB3_AN_PORT, BOARD_INITPINS_MB3_AN_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTB7 (pin F11) is configured as PTB7 */
    PORT_SetPinMux(BOARD_INITPINS_MB3_INT_PORT, BOARD_INITPINS_MB3_INT_PIN, kPORT_MuxAsGpio);

    /* PORTB8 (pin F10) is configured as PTB8 */
    PORT_SetPinMux(BOARD_INITPINS_MB2_INT_PORT, BOARD_INITPINS_MB2_INT_PIN, kPORT_MuxAsGpio);

    /* PORTB9 (pin F9) is configured as SPI1_PCS1 */
    PORT_SetPinMux(BOARD_INITPINS_SPI1_PCS1_PORT, BOARD_INITPINS_SPI1_PCS1_PIN, kPORT_MuxAlt2);

    /* PORTC0 (pin B12) is configured as PTC0 */
    PORT_SetPinMux(BOARD_INITPINS_AMB_INT_PORT, BOARD_INITPINS_AMB_INT_PIN, kPORT_MuxAsGpio);

