theophieleroy/rapid_iot_mcuxpresso_examples/board/pin_mux.c
    /* PORTC1 (pin B11) is configured as PTC1 */
    PORT_SetPinMux(BOARD_INITPINS_ACCEL_INT1_PORT, BOARD_INITPINS_ACCEL_INT1_PIN, kPORT_MuxAsGpio);

    /* PORTC10 (pin C7) is configured as I2C1_SCL */
    PORT_SetPinMux(BOARD_INITPINS_I2C1_SCL_PORT, BOARD_INITPINS_I2C1_SCL_PIN, kPORT_MuxAlt2);

    PORTC->PCR[10] = ((PORTC->PCR[10] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_ODE_MASK | PORT_PCR_DSE_MASK | PORT_PCR_ISF_MASK)))

                      /* Open Drain Enable: Open drain output is enabled on the corresponding pin, if the pin is
                       * configured as a digital output. */
                      | PORT_PCR_ODE(kPORT_OpenDrainEnable)

                      /* Drive Strength Enable: High drive strength is configured on the corresponding pin, if pin
                       * is configured as a digital output. */
                      | PORT_PCR_DSE(kPORT_HighDriveStrength));

    /* PORTC11 (pin B7) is configured as I2C1_SDA */
    PORT_SetPinMux(BOARD_INITPINS_I2C1_SDA_PORT, BOARD_INITPINS_I2C1_SDA_PIN, kPORT_MuxAlt2);

    PORTC->PCR[11] = ((PORTC->PCR[11] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_ODE_MASK | PORT_PCR_DSE_MASK | PORT_PCR_ISF_MASK)))

                      /* Open Drain Enable: Open drain output is enabled on the corresponding pin, if the pin is
                       * configured as a digital output. */
                      | PORT_PCR_ODE(kPORT_OpenDrainEnable)

                      /* Drive Strength Enable: High drive strength is configured on the corresponding pin, if pin
                       * is configured as a digital output. */
                      | PORT_PCR_DSE(kPORT_HighDriveStrength));

    /* PORTC12 (pin A7) is configured as PTC12 */
    PORT_SetPinMux(BOARD_INITPINS_NTAG_EN_PORT, BOARD_INITPINS_NTAG_EN_PIN, kPORT_MuxAsGpio);

    /* PORTC13 (pin D6) is configured as PTC13 */
    PORT_SetPinMux(BOARD_INITPINS_KW41_PB18_PORT, BOARD_INITPINS_KW41_PB18_PIN, kPORT_MuxAsGpio);

    PORTC->PCR[13] = ((PORTC->PCR[13] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_ODE_MASK | PORT_PCR_DSE_MASK | PORT_PCR_ISF_MASK)))

                      /* Open Drain Enable: Open drain output is enabled on the corresponding pin, if the pin is
                       * configured as a digital output. */
                      | PORT_PCR_ODE(kPORT_OpenDrainEnable)

                      /* Drive Strength Enable: High drive strength is configured on the corresponding pin, if pin
                       * is configured as a digital output. */
                      | PORT_PCR_DSE(kPORT_HighDriveStrength));

    /* PORTC14 (pin C6) is configured as PTC14 */
    PORT_SetPinMux(BOARD_INITPINS_BAT_SENS_EN_PORT, BOARD_INITPINS_BAT_SENS_EN_PIN, kPORT_MuxAsGpio);

    /* PORTC15 (pin B6) is configured as PTC15 */
    PORT_SetPinMux(BOARD_INITPINS_GYRO_RST_PORT, BOARD_INITPINS_GYRO_RST_PIN, kPORT_MuxAsGpio);

    PORTC->PCR[15] = ((PORTC->PCR[15] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_ODE_MASK | PORT_PCR_DSE_MASK | PORT_PCR_ISF_MASK)))

                      /* Open Drain Enable: Open drain output is enabled on the corresponding pin, if the pin is
                       * configured as a digital output. */
                      | PORT_PCR_ODE(kPORT_OpenDrainEnable)

                      /* Drive Strength Enable: High drive strength is configured on the corresponding pin, if pin
                       * is configured as a digital output. */
                      | PORT_PCR_DSE(kPORT_HighDriveStrength));

    /* PORTC16 (pin A6) is configured as UART3_RX */
    PORT_SetPinMux(BOARD_INITPINS_UART3_RX_PORT, BOARD_INITPINS_UART3_RX_PIN, kPORT_MuxAlt3);

    /* PORTC17 (pin D5) is configured as UART3_TX */
    PORT_SetPinMux(BOARD_INITPINS_UART3_TX_PORT, BOARD_INITPINS_UART3_TX_PIN, kPORT_MuxAlt3);

    /* PORTC18 (pin C5) is configured as PTC18 */
    PORT_SetPinMux(BOARD_INITPINS_GYRO_INT2_PORT, BOARD_INITPINS_GYRO_INT2_PIN, kPORT_MuxAsGpio);

    /* PORTC19 (pin B5) is configured as PTC19 */
    PORT_SetPinMux(BOARD_INITPINS_USB_VBUS_PORT, BOARD_INITPINS_USB_VBUS_PIN, kPORT_MuxAsGpio);

    /* PORTC2 (pin A12) is configured as SPI0_PCS2 */
    PORT_SetPinMux(BOARD_INITPINS_MB3_SPI_CS_PORT, BOARD_INITPINS_MB3_SPI_CS_PIN, kPORT_MuxAlt2);

    /* PORTC3 (pin A11) is configured as SPI0_PCS1 */
    PORT_SetPinMux(BOARD_INITPINS_MB2_SPI_CS_PORT, BOARD_INITPINS_MB2_SPI_CS_PIN, kPORT_MuxAlt2);

    /* PORTC4 (pin A9) is configured as SPI0_PCS0 */
    PORT_SetPinMux(BOARD_INITPINS_MB1_SPI_CS_PORT, BOARD_INITPINS_MB1_SPI_CS_PIN, kPORT_MuxAlt2);

    /* PORTC5 (pin D8) is configured as SPI0_SCK */
    PORT_SetPinMux(BOARD_INITPINS_MB_SPI_SCK_PORT, BOARD_INITPINS_MB_SPI_SCK_PIN, kPORT_MuxAlt2);

    /* PORTC6 (pin C8) is configured as SPI0_SOUT */
    PORT_SetPinMux(BOARD_INITPINS_MB_SPI_MOSI_PORT, BOARD_INITPINS_MB_SPI_MOSI_PIN, kPORT_MuxAlt2);

    /* PORTC7 (pin B8) is configured as SPI0_SIN */
    PORT_SetPinMux(BOARD_INITPINS_MB_SPI_MISO_PORT, BOARD_INITPINS_MB_SPI_MISO_PIN, kPORT_MuxAlt2);

    /* PORTC8 (pin A8) is configured as FTM3_CH4 */
    PORT_SetPinMux(BOARD_INITPINS_RGB_R_PORT, BOARD_INITPINS_RGB_R_PIN, kPORT_MuxAlt3);

    /* PORTC9 (pin D7) is configured as FTM3_CH5 */
    PORT_SetPinMux(BOARD_INITPINS_RGB_B_PORT, BOARD_INITPINS_RGB_B_PIN, kPORT_MuxAlt3);

    /* PORTD0 (pin A5) is configured as PTD0 */
    PORT_SetPinMux(BOARD_INITPINS_RTC_INT_PORT, BOARD_INITPINS_RTC_INT_PIN, kPORT_MuxAsGpio);

    PORTD->PCR[0] = ((PORTD->PCR[0] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullUp));

