theophieleroy/rapid_iot_mcuxpresso_examples/board/pin_mux.c
    /* PORTD1 (pin D4) is configured as PTD1 */
    PORT_SetPinMux(BOARD_INITPINS_GYRO_INT1_PORT, BOARD_INITPINS_GYRO_INT1_PIN, kPORT_MuxAsGpio);

    /* PORTD10 (pin B3) is configured as PTD10 */
    PORT_SetPinMux(BOARD_INITPINS_PRESSURE_INT2_PORT, BOARD_INITPINS_PRESSURE_INT2_PIN, kPORT_MuxAsGpio);

    /* PORTD11 (pin B2) is configured as PTD11 */
    PORT_SetPinMux(BOARD_INITPINS_ACCEL_RST_PORT, BOARD_INITPINS_ACCEL_RST_PIN, kPORT_MuxAsGpio);

    /* PORTD12 (pin B1) is configured as PTD12 */
    PORT_SetPinMux(BOARD_INITPINS_PRESSURE_INT1_PORT, BOARD_INITPINS_PRESSURE_INT1_PIN, kPORT_MuxAsGpio);

    /* PORTD13 (pin C3) is configured as PTD13 */
    PORT_SetPinMux(BOARD_INITPINS_ACCEL_INT2_PORT, BOARD_INITPINS_ACCEL_INT2_PIN, kPORT_MuxAsGpio);

    /* PORTD14 (pin C2) is configured as PTD14 */
    PORT_SetPinMux(BOARD_INITPINS_RTC_CLKOE_PORT, BOARD_INITPINS_RTC_CLKOE_PIN, kPORT_MuxAsGpio);

    /* PORTD15 (pin C1) is configured as PTD15 */
    PORT_SetPinMux(BOARD_INITPINS_DISP_DISP_PORT, BOARD_INITPINS_DISP_DISP_PIN, kPORT_MuxAsGpio);

    /* PORTD2 (pin C4) is configured as UART2_RX */
    PORT_SetPinMux(BOARD_INITPINS_UART2_RX_PORT, BOARD_INITPINS_UART2_RX_PIN, kPORT_MuxAlt3);

    /* PORTD3 (pin B4) is configured as UART2_TX */
    PORT_SetPinMux(BOARD_INITPINS_UART2_TX_PORT, BOARD_INITPINS_UART2_TX_PIN, kPORT_MuxAlt3);

    /* PORTD4 (pin A4) is configured as SPI1_PCS0 */
    PORT_SetPinMux(BOARD_INITPINS_SPI1_PCS0_PORT, BOARD_INITPINS_SPI1_PCS0_PIN, kPORT_MuxAlt7);

    PORTD->PCR[4] = ((PORTD->PCR[4] &
                      /* Mask bits to zero which are setting */
//                      (~(PORT_PCR_ODE_MASK | PORT_PCR_DSE_MASK | PORT_PCR_ISF_MASK)))
                      (~(PORT_PCR_ODE_MASK | PORT_PCR_DSE_MASK)))

                     /* Open Drain Enable: Open drain output is enabled on the corresponding pin, if the pin is
                      * configured as a digital output. */
                     | PORT_PCR_ODE(kPORT_OpenDrainEnable)

                     /* Drive Strength Enable: High drive strength is configured on the corresponding pin, if pin
                      * is configured as a digital output. */
                     | PORT_PCR_DSE(kPORT_HighDriveStrength));

    /* PORTD5 (pin A3) is configured as SPI1_SCK */
    PORT_SetPinMux(BOARD_INITPINS_SPI1_SCK_PORT, BOARD_INITPINS_SPI1_SCK_PIN, kPORT_MuxAlt7);

    /* PORTD6 (pin A2) is configured as SPI1_SOUT */
    PORT_SetPinMux(BOARD_INITPINS_SPI1_MOSI_PORT, BOARD_INITPINS_SPI1_MOSI_PIN, kPORT_MuxAlt7);

    /* PORTD7 (pin A1) is configured as SPI1_SIN */
    PORT_SetPinMux(BOARD_INITPINS_SPI1_MISO_PORT, BOARD_INITPINS_SPI1_MISO_PIN, kPORT_MuxAlt7);

    PORTD->PCR[7] = ((PORTD->PCR[7] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_DSE_MASK | PORT_PCR_ISF_MASK)))

                     /* Drive Strength Enable: Low drive strength is configured on the corresponding pin, if pin
                      * is configured as a digital output. */
                     | PORT_PCR_DSE(kPORT_LowDriveStrength));

    /* PORTD8 (pin C9) is configured as PTD8 */
    PORT_SetPinMux(BOARD_INITPINS_AIR_QUALITY_I2C_EN_PORT, BOARD_INITPINS_AIR_QUALITY_I2C_EN_PIN, kPORT_MuxAsGpio);

    /* PORTD9 (pin B9) is configured as PTD9 */
    PORT_SetPinMux(BOARD_INITPINS_DISP_EN_PORT, BOARD_INITPINS_DISP_EN_PIN, kPORT_MuxAsGpio);

    /* PORTE0 (pin D3) is configured as SDHC0_D1 */
    PORT_SetPinMux(BOARD_INITPINS_SD_D1_PORT, BOARD_INITPINS_SD_D1_PIN, kPORT_MuxAlt4);

    /* PORTE1 (pin D2) is configured as SDHC0_D0 */
    PORT_SetPinMux(BOARD_INITPINS_SD_D0_PORT, BOARD_INITPINS_SD_D0_PIN, kPORT_MuxAlt4);

    /* PORTE10 (pin F1) is configured as PTE10 */
    PORT_SetPinMux(BOARD_INITPINS_USER_SW3_PORT, BOARD_INITPINS_USER_SW3_PIN, kPORT_MuxAsGpio);

    PORTE->PCR[10] = ((PORTE->PCR[10] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PFE_MASK | PORT_PCR_ISF_MASK)))

                      /* Passive Filter Enable: Passive input filter is enabled on the corresponding pin, if the
                       * pin is configured as a digital input. Refer to the device data sheet for filter characteristics. */
                      | PORT_PCR_PFE(kPORT_PassiveFilterEnable));

    /* PORTE11 (pin G4) is configured as PTE11 */
    PORT_SetPinMux(BOARD_INITPINS_DISP_EXTMODE_PORT, BOARD_INITPINS_DISP_EXTMODE_PIN, kPORT_MuxAsGpio);

    /* PORTE12 (pin G3) is configured as FTM3_CH7 */
    PORT_SetPinMux(BOARD_INITPINS_DISP_BLIGHT_PORT, BOARD_INITPINS_DISP_BLIGHT_PIN, kPORT_MuxAlt6);

    /* PORTE2 (pin D1) is configured as SDHC0_DCLK */
    PORT_SetPinMux(BOARD_INITPINS_SD_CLK_PORT, BOARD_INITPINS_SD_CLK_PIN, kPORT_MuxAlt4);

    /* PORTE24 (pin M4) is configured as UART4_TX */
    PORT_SetPinMux(BOARD_INITPINS_KW41_UART_RX_PORT, BOARD_INITPINS_KW41_UART_RX_PIN, kPORT_MuxAlt3);

    /* PORTE25 (pin K5) is configured as UART4_RX */
    PORT_SetPinMux(BOARD_INITPINS_KW41_UART_TX_PORT, BOARD_INITPINS_KW41_UART_TX_PIN, kPORT_MuxAlt3);

    /* PORTE26 (pin K4) is configured as UART4_CTS_b */
    PORT_SetPinMux(BOARD_INITPINS_KW41_UART_RTS_PORT, BOARD_INITPINS_KW41_UART_RTS_PIN, kPORT_MuxAsGpio);

    PORTE->PCR[26] = ((PORTE->PCR[26] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_PFE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | PORT_PCR_PS(kPORT_PullDown)

                     /* Pull Enable: Internal pullup or pulldown resistor is not enabled on the corresponding pin. */
//                     | PORT_PCR_PE(kPORT_PullEnable)

                     /* Passive Filter Enable: Passive input filter is enabled on the corresponding pin, if the
                      * pin is configured as a digital input. Refer to the device data sheet for filter characteristics. */
                     | PORT_PCR_PFE(kPORT_PassiveFilterEnable)

					 | PORT_PCR_ISF(kPORT_InterruptRisingEdge)


