theophieleroy/rapid_iot_mcuxpresso_examples/board/pin_mux.c
    );

    /* PORTE27 (pin J4) is configured as UART4_RTS_b */
    PORT_SetPinMux(BOARD_INITPINS_KW41_UART_CTS_PORT, BOARD_INITPINS_KW41_UART_CTS_PIN, kPORT_MuxAsGpio);

    /* PORTE28 (pin H4) is configured as PTE28 */
    PORT_SetPinMux(BOARD_INITPINS_USER_SW4_PORT, BOARD_INITPINS_USER_SW4_PIN, kPORT_MuxAsGpio);

    PORTE->PCR[28] = ((PORTE->PCR[28] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PFE_MASK | PORT_PCR_ISF_MASK)))

                      /* Passive Filter Enable: Passive input filter is enabled on the corresponding pin, if the
                       * pin is configured as a digital input. Refer to the device data sheet for filter characteristics. */
                      | PORT_PCR_PFE(kPORT_PassiveFilterEnable));

    /* PORTE3 (pin E4) is configured as SDHC0_CMD */
    PORT_SetPinMux(BOARD_INITPINS_SD_CMD_PORT, BOARD_INITPINS_SD_CMD_PIN, kPORT_MuxAlt4);

    /* PORTE4 (pin E3) is configured as SDHC0_D3 */
    PORT_SetPinMux(BOARD_INITPINS_SD_D3_PORT, BOARD_INITPINS_SD_D3_PIN, kPORT_MuxAlt4);

    /* PORTE5 (pin E2) is configured as SDHC0_D2 */
    PORT_SetPinMux(BOARD_INITPINS_SD_D2_PORT, BOARD_INITPINS_SD_D2_PIN, kPORT_MuxAlt4);

    /* PORTE6 (pin E1) is configured as FTM3_CH1 */
    PORT_SetPinMux(PORTE, 6U, kPORT_MuxAlt6);

    /* PORTE7 (pin F4) is configured as FTM3_CH2 */
    PORT_SetPinMux(BOARD_INITPINS_RGB_G_PORT, BOARD_INITPINS_RGB_G_PIN, kPORT_MuxAlt6);

    /* PORTE9 (pin F2) is configured as PTE9 */
    PORT_SetPinMux(BOARD_INITPINS_USER_SW2_PORT, BOARD_INITPINS_USER_SW2_PIN, kPORT_MuxAsGpio);

    PORTE->PCR[9] = ((PORTE->PCR[9] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PFE_MASK | PORT_PCR_ISF_MASK)))

                     /* Passive Filter Enable: Passive input filter is enabled on the corresponding pin, if the
                      * pin is configured as a digital input. Refer to the device data sheet for filter characteristics. */
                     | PORT_PCR_PFE(kPORT_PassiveFilterEnable));

    SIM->SOPT4 = ((SIM->SOPT4 &
                   /* Mask bits to zero which are setting */
                   (~(SIM_SOPT4_FTM1CH0SRC_MASK | SIM_SOPT4_FTM2CH0SRC_MASK)))

                  /* FTM1 channel 0 input capture source select: FTM1_CH0 signal. */
                  | SIM_SOPT4_FTM1CH0SRC(SOPT4_FTM1CH0SRC_FTM)

                  /* FTM2 channel 0 input capture source select: FTM2_CH0 signal. */
                  | SIM_SOPT4_FTM2CH0SRC(SOPT4_FTM2CH0SRC_FTM));

    SIM->SOPT5 = ((SIM->SOPT5 &
                   /* Mask bits to zero which are setting */
                   (~(SIM_SOPT5_UART0TXSRC_MASK)))

                  /* UART 0 transmit data source select: UART0_TX pin. */
                  | SIM_SOPT5_UART0TXSRC(SOPT5_UART0TXSRC_UART_TX));
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
RTC_INT_IRQ:
- options: {callFromInitBoot: 'false', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: A5, peripheral: GPIOD, signal: 'GPIO, 0', pin_signal: PTD0/LLWU_P12/SPI0_PCS0/UART2_RTS_b/FTM3_CH0/FB_ALE/FB_CS1_b/FB_TS_b, direction: INPUT, slew_rate: fast,
    open_drain: no_init, pull_select: up, pull_enable: enable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : RTC_INT_IRQ
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void RTC_INT_IRQ(void)
{
    /* Port D Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortD);

    /* PORTD0 (pin A5) is configured as PTD0 */
    PORT_SetPinMux(RTC_INT_IRQ_RTC_INT_PORT, RTC_INT_IRQ_RTC_INT_PIN, kPORT_MuxAsGpio);

    PORTD->PCR[0] = ((PORTD->PCR[0] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_SRE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullUp)

                     /* Slew Rate Enable: Fast slew rate is configured on the corresponding pin, if the pin is
                      * configured as a digital output. */
                     | PORT_PCR_SRE(kPORT_FastSlewRate));
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
DSPI2_InitPins:
- options: {callFromInitBoot: 'false', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: D9, peripheral: SPI2, signal: SCK, pin_signal: PTB21/SPI2_SCK/FB_AD30/CMP1_OUT}
  - {pin_num: C12, peripheral: SPI2, signal: SOUT, pin_signal: PTB22/SPI2_SOUT/FB_AD29/CMP2_OUT}
  - {pin_num: D10, peripheral: GPIOB, signal: 'GPIO, 20', pin_signal: PTB20/SPI2_PCS0/FB_AD31/CMP0_OUT, direction: OUTPUT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : DSPI2_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void DSPI2_InitPins(void)
{
    /* Port B Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortB);

    /* PORTB20 (pin D10) is configured as PTB20 */
    PORT_SetPinMux(DSPI2_INITPINS_DISP_SPI_CS_PORT, DSPI2_INITPINS_DISP_SPI_CS_PIN, kPORT_MuxAsGpio);

    /* PORTB21 (pin D9) is configured as SPI2_SCK */
    PORT_SetPinMux(DSPI2_INITPINS_DISP_SPI_SCK_PORT, DSPI2_INITPINS_DISP_SPI_SCK_PIN, kPORT_MuxAlt2);

    /* PORTB22 (pin C12) is configured as SPI2_SOUT */
    PORT_SetPinMux(DSPI2_INITPINS_DISP_SPI_SDI_PORT, DSPI2_INITPINS_DISP_SPI_SDI_PIN, kPORT_MuxAlt2);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
DSPI2_DeinitPins:
- options: {callFromInitBoot: 'false', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: D9, peripheral: n/a, signal: disabled, pin_signal: PTB21/SPI2_SCK/FB_AD30/CMP1_OUT}
  - {pin_num: D10, peripheral: n/a, signal: disabled, pin_signal: PTB20/SPI2_PCS0/FB_AD31/CMP0_OUT}
  - {pin_num: C12, peripheral: n/a, signal: disabled, pin_signal: PTB22/SPI2_SOUT/FB_AD29/CMP2_OUT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : DSPI2_DeinitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void DSPI2_DeinitPins(void)
{
    /* Port B Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortB);

    /* PORTB20 (pin D10) is disabled */
    PORT_SetPinMux(DSPI2_DEINITPINS_DISP_SPI_CS_PORT, DSPI2_DEINITPINS_DISP_SPI_CS_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTB21 (pin D9) is disabled */
    PORT_SetPinMux(DSPI2_DEINITPINS_DISP_SPI_SCK_PORT, DSPI2_DEINITPINS_DISP_SPI_SCK_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTB22 (pin C12) is disabled */
    PORT_SetPinMux(DSPI2_DEINITPINS_DISP_SPI_SDI_PORT, DSPI2_DEINITPINS_DISP_SPI_SDI_PIN, kPORT_PinDisabledOrAnalog);
}

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
